//=============================================================================
//			Utility Functions
//				Programmed by C60
//=============================================================================

#ifdef WINDOWS
#include	<windows.h>
#include	<mbstring.h>
#endif
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include	"util.h"


//=============================================================================
//	¥Õ¥¡¥¤¥ëÌ¾¤Ç¼¨¤µ¤ì¤¿¥Õ¥¡¥¤¥ë¤Î¥µ¥¤¥º¤ò¼èÆÀ¤¹¤ë
//=============================================================================
_int64 GetFileSize_s(char *filename)
{
#ifdef WINDOWS
	HANDLE	handle;
	WIN32_FIND_DATA	FindFileData;

	if((handle = FindFirstFile(filename, &FindFileData)) == INVALID_HANDLE_VALUE) {
		return -1;		// ¼èÆÀÉÔ²Ä
	} else {
		FindClose(handle);
		return (_int64)(FindFileData.nFileSizeHigh << 32) + FindFileData.nFileSizeLow; 
 	}
#else
	FILE *fp;
	int size;

	fp = fopen (filename, "rb");
	if (!fp)
	  {
	    int i;
	    
	    for (i = 0; i < strlen (filename); i ++)
	      filename[i] = tolower (filename[i]);

	    fp = fopen (filename, "rb");
	    if (!fp)
		return -1;
	  }

	fseek (fp, 0, SEEK_END);
	size = (int)ftell (fp);
	fclose (fp);

	return size;
#endif
}


//=============================================================================
//	TAB ¤ò SPACE ¤ËÊÑ´¹(tabcolumn ¥«¥é¥àËè / ESC¥·¡¼¥±¥ó¥¹ÉÔ²Ä)
//=============================================================================
char *tab2spc(char *dest, const char *src, int tabcolumn)
{
	int		column = 0;
	char	*dest2;

	dest2 = dest;
	while(*src != '\0') {
		if(*src == '\t') {							// TAB
			src++;
			do {
				*dest++ = ' ';
			}while(++column % tabcolumn);
		} else if(*src == 0x0d || *src == 0x0a) {	// ²þ¹Ô
			column = 0;
			*dest++ = *src++;
		} else {
			*dest++ = *src++;
			column++;
		}
	}
	*dest = '\0';
	return dest2;
}


//=============================================================================
//	¥¨¥¹¥±¡¼¥×¥·¡¼¥±¥ó¥¹¤Î½üµî
//	¥«¡¼¥½¥ë°ÜÆ°·Ï¥¨¥¹¥±¡¼¥×¥·¡¼¥±¥ó¥¹¤Ë¤ÏÈóÂÐ±þ
//=============================================================================
char *delesc(char *dest, const char *src)
{
	char	*dest2;
	uchar	*src2;
	uchar	*src3;
	size_t	i;

	if((src2 = src3 = (uchar *)malloc(strlen(src) + 32)) == NULL) {
		return NULL;
	};

	strcpy((char *)src2, src);

	// 31¥Ð¥¤¥ÈÏ¢Â³ '\0' ¤Ë¤¹¤ë(8 °Ê¾å¤Ê¤é OK ¤Ê¤Ï¤º¤À¤±¤É¡¤Ç°¤Î¤¿¤á¡Ë
	for(i = strlen((char *)src2); i < strlen((char *)src2) + 31; i++) {
		src2[i] = '\0';
	}

	dest2 = dest;

	do {
		if(*src2 == 0x1b) {		// ¥¨¥¹¥±¡¼¥×¥·¡¼¥±¥ó¥¹
			if(*(src2 + 1) == '[') {
				src2 += 2;
				while(*src2 && (toupper(*src2) < 'A' || toupper(*src2) > 'Z')) {
					if(_ismbblead(*src2)) {
						src2 += 2;
						continue;
					}
					src2++;
				}
				src2++;
			} else if(*(src2 + 1) == '=') {
				src2 += 4;
			} else if(*(src2 + 1) == ')' || *(src2 + 1) == '!') {
				src2 += 3;
			} else {
				src2 += 2;
			}
		} else {
			*dest++ = *src2++;		
		}
	}while(*src2 != '\0');

	free(src3);
	*dest = '\0';
	return dest2;
}


//=============================================================================
//	£²¥Ð¥¤¥ÈÈ¾³ÑÊ¸»ú¤òÈ¾³Ñ¤ËÊÑ´¹
//=============================================================================
char *zen2tohan(char *dest, const char *src)
{
	char *src2;
	char *src3;
	char *dest2;
	int	len;
	static const char *codetable[] = {
		"!",		/*	8540 	*/
		"\"",		/*	8541 	*/
		"#",		/*	8542 	*/
		"$",		/*	8543 	*/
		"%",		/*	8544 	*/
		"&",		/*	8545 	*/
		"'",		/*	8546 	*/
		"(",		/*	8547 	*/
		")",		/*	8548 	*/
		"*",		/*	8549 	*/
		"+",		/*	854a 	*/
		",",		/*	854b 	*/
		"-",		/*	854c 	*/
		".",		/*	854d 	*/
		"/",		/*	854e 	*/
		"0",		/*	854f 	*/
		"1",		/*	8550 	*/
		"2",		/*	8551 	*/
		"3",		/*	8552 	*/
		"4",		/*	8553 	*/
		"5",		/*	8554 	*/
		"6",		/*	8555 	*/
		"7",		/*	8556 	*/
		"8",		/*	8557 	*/
		"9",		/*	8558 	*/
		":",		/*	8559 	*/
		";",		/*	855a 	*/
		"<",		/*	855b 	*/
		"=",		/*	855c 	*/
		">",		/*	855d 	*/
		"?",		/*	855e 	*/
		"@",		/*	855f 	*/
		"A",		/*	8560 	*/
		"B",		/*	8561 	*/
		"C",		/*	8562 	*/
		"D",		/*	8563 	*/
		"E",		/*	8564 	*/
		"F",		/*	8565 	*/
		"G",		/*	8566 	*/
		"H",		/*	8567 	*/
		"I",		/*	8568 	*/
		"J",		/*	8569 	*/
		"K",		/*	856a 	*/
		"L",		/*	856b 	*/
		"M",		/*	856c 	*/
		"N",		/*	856d 	*/
		"O",		/*	856e 	*/
		"P",		/*	856f 	*/
		"Q",		/*	8570 	*/
		"R",		/*	8571 	*/
		"S",		/*	8572 	*/
		"T",		/*	8573 	*/
		"U",		/*	8574 	*/
		"V",		/*	8575 	*/
		"W",		/*	8576 	*/
		"X",		/*	8577 	*/
		"Y",		/*	8578 	*/
		"Z",		/*	8579 	*/
		"[",		/*	857a 	*/
		"\\",		/*	857b 	*/
		"]",		/*	857c 	*/
		"^",		/*	857d 	*/
		"_",		/*	857e 	*/
		"",			/*	857f 	*/
		"`",		/*	8580 	*/
		"a",		/*	8581 	*/
		"b",		/*	8582 	*/
		"c",		/*	8583 	*/
		"d",		/*	8584 	*/
		"e",		/*	8585 	*/
		"f",		/*	8586 	*/
		"g",		/*	8587 	*/
		"h",		/*	8588 	*/
		"i",		/*	8589 	*/
		"j",		/*	858a 	*/
		"k",		/*	858b 	*/
		"l",		/*	858c 	*/
		"m",		/*	858d 	*/
		"n",		/*	858e 	*/
		"o",		/*	858f 	*/
		"p",		/*	8590 	*/
		"q",		/*	8591 	*/
		"r",		/*	8592 	*/
		"s",		/*	8593 	*/
		"t",		/*	8594 	*/
		"u",		/*	8595 	*/
		"v",		/*	8596 	*/
		"w",		/*	8597 	*/
		"x",		/*	8598 	*/
		"y",		/*	8599 	*/
		"z",		/*	859a 	*/
		"{",		/*	859b 	*/
		"|",		/*	859c 	*/
		"}",		/*	859d 	*/
		"©þ",		/*	859e 	*/
		"¡£",		/*	859f 	*/
		"¡Ö",		/*	85a0 	*/
		"¡×",		/*	85a1 	*/
		"¡¢",		/*	85a2 	*/
		"¡¦",		/*	85a3 	*/
		"¥ò",		/*	85a4 	*/
		"¥¡",		/*	85a5 	*/
		"¥£",		/*	85a6 	*/
		"¥¥",		/*	85a7 	*/
		"¥§",		/*	85a8 	*/
		"¥©",		/*	85a9 	*/
		"¥ã",		/*	85aa 	*/
		"¥å",		/*	85ab 	*/
		"¥ç",		/*	85ac 	*/
		"¥Ã",		/*	85ad 	*/
		"¡¼",		/*	85ae 	*/
		"¥¢",		/*	85af 	*/
		"¥¤",		/*	85b0 	*/
		"¥¦",		/*	85b1 	*/
		"¥¨",		/*	85b2 	*/
		"¥ª",		/*	85b3 	*/
		"¥«",		/*	85b4 	*/
		"¥­",		/*	85b5 	*/
		"¥¯",		/*	85b6 	*/
		"¥±",		/*	85b7 	*/
		"¥³",		/*	85b8 	*/
		"¥µ",		/*	85b9 	*/
		"¥·",		/*	85ba 	*/
		"¥¹",		/*	85bb 	*/
		"¥»",		/*	85bc 	*/
		"¥½",		/*	85bd 	*/
		"¥¿",		/*	85be 	*/
		"¥Á",		/*	85bf 	*/
		"¥Ä",		/*	85c0 	*/
		"¥Æ",		/*	85c1 	*/
		"¥È",		/*	85c2 	*/
		"¥Ê",		/*	85c3 	*/
		"¥Ë",		/*	85c4 	*/
		"¥Ì",		/*	85c5 	*/
		"¥Í",		/*	85c6 	*/
		"¥Î",		/*	85c7 	*/
		"¥Ï",		/*	85c8 	*/
		"¥Ò",		/*	85c9 	*/
		"¥Õ",		/*	85ca 	*/
		"¥Ø",		/*	85cb 	*/
		"¥Û",		/*	85cc 	*/
		"¥Þ",		/*	85cd 	*/
		"¥ß",		/*	85ce 	*/
		"¥à",		/*	85cf 	*/
		"¥á",		/*	85d0 	*/
		"¥â",		/*	85d1 	*/
		"¥ä",		/*	85d2 	*/
		"¥æ",		/*	85d3 	*/
		"¥è",		/*	85d4 	*/
		"¥é",		/*	85d5 	*/
		"¥ê",		/*	85d6 	*/
		"¥ë",		/*	85d7 	*/
		"¥ì",		/*	85d8 	*/
		"¥í",		/*	85d9 	*/
		"¥ï",		/*	85da 	*/
		"¥ó",		/*	85db 	*/
		"¡«",		/*	85dc 	*/
		"¡¬",		/*	85dd 	*/
		"ªà",		/*	85de 	*/
		"ªá",		/*	85df 	*/
		"¥ï",		/*	85e0 	*/
		"¥«",		/*	85e1 	*/
		"¥±",		/*	85e2 	*/
		"¥ô",		/*	85e3 	*/
		"¥¬",		/*	85e4 	*/
		"¥®",		/*	85e5 	*/
		"¥°",		/*	85e6 	*/
		"¥²",		/*	85e7 	*/
		"¥´",		/*	85e8 	*/
		"¥¶",		/*	85e9 	*/
		"¥¸",		/*	85ea 	*/
		"¥º",		/*	85eb 	*/
		"¥¼",		/*	85ec 	*/
		"¥¾",		/*	85ed 	*/
		"¥À",		/*	85ee 	*/
		"¥Â",		/*	85ef 	*/
		"¥Å",		/*	85f0 	*/
		"¥Ç",		/*	85f1 	*/
		"¥É",		/*	85f2 	*/
		"¥Ð",		/*	85f3 	*/
		"¥Ñ",		/*	85f4 	*/
		"¥Ó",		/*	85f5 	*/
		"¥Ô",		/*	85f6 	*/
		"¥Ö",		/*	85f7 	*/
		"¥×",		/*	85f8 	*/
		"¥Ù",		/*	85f9 	*/
		"¥Ú",		/*	85fa 	*/
		"¥Ü",		/*	85fb 	*/
		"¥Ý"		/*	85fc 	*/
	};

	if((src2 = src3 = (char *)malloc(strlen(src) + 2)) == NULL) {
		return NULL;
	};

	strcpy(src2, src);
	src2[strlen(src2)+1] = '\0';		// 2¥Ð¥¤¥ÈÏ¢Â³ '\0' ¤Ë¤¹¤ë

	dest2 = dest;
	do {
		if(_ismbblead(*(uchar *)src2)) {		// ´Á»ú£±¥Ð¥¤¥ÈÌÜ
			if(*(uchar *)src2 == 0x85 &&
					*(uchar *)(src2+1) >= 0x40 && *(uchar *)(src2+1) <= 0xfc) {	// 2¥Ð¥¤¥ÈÈ¾³Ñ
				len = (int)strlen(codetable[*(uchar *)(src2+1) - 0x40]);
				strncpy(dest, codetable[*(uchar *)(src2+1) - 0x40], len);
				src2 += 2;
				dest += len;
			} else {
				*dest++ = *src2++;
				*dest++ = *src2++;
			}
		} else {
			*dest++ = *src2++;
		}
	}while(*src2 != '\0');

	free(src3);
	if(strlen(dest2) > 0) {
		if(*(dest - 1) != '\0') {
			*dest = '\0';
		}
	}
	return dest2;
}
