Repository: yoyofr/modizer
Catalog: *.lproj/Localizable.strings
Languages: fr

source: Due to internal changes, settings will be reseted to default and database will be cleaned. As a consequence, some entries might disappear from existing playlist.
fr: Suite à des changements internes, les réglages vont être réinitialisés et la BD nettoyée. En conséquence, des entrées peuvent disparaître dans les playlists.

source: [Please describe your request below]
fr: [Veuillez décrire votre requête ci-dessous]

source: %d entries
fr: %d entrées

source: %d files.
fr: %d fichiers.

source: 1 entry
fr: 1 entrée

source: 1 file.
fr: 1 fichier.

source: About
fr: A propos

source: Add a playlist...
fr: Ajouter une liste

source: Add archive entry
fr: Ajouter l'entrée d'archive

source: Add current file
fr: Ajouter le fichier

source: Add current subsong
fr: Ajouter le subsong

source: Add or remove entries from browser.
fr: Ajouter ou supprimer des entrées.

source: Add to a playlist
fr: Ajouter à une liste

source: Add to favorites
fr: Ajouter aux favoris

source: Add/Remove files...
fr: Ajouter/Supprimer fichiers...

source: All voices
fr: Toutes les voix

source: Are you sure you want to delete this entry ?
fr: Etes vous sûr de vouloir supprimer cette entrée ?

source: Are you sure you want to delete this playlist ?
fr: Etes vous sûr de vouloir supprimer cette liste ?

source: Artists: %d entries.
fr: Artistes: %d entrées.

source: Artists/Files
fr: Artistes/Fichiers

source: Artists/Formats/Files
fr: Artistes/Formats/Fichiers

source: ASMA/Search off
fr: ASMA/Recherche off

source: available
fr: disponible

source: Blue
fr: Bleu

source: Bookmarks
fr: Favoris

source: Brightness
fr: Luminosité

source: Browse files
fr: Parcourir les fichiers

source: Browse Internet
fr: Parcourir Internet

source: Browser not enough mem.
fr: Trop d'entrées, ne peut allouer assez de mémoire.

source: Browser not enough mem. Limited.
fr: Trop d'entrées, ne peut allouer assez de mémoire. Liste tronquée.

source: Browser_Favorites_MainKey
fr: Favoris

source: Browser_Favorites_SubKey
fr: Ecouter les fichiers les mieux notés.

source: Browser_HVSC_MainKey
fr: HVSC collection

source: Browser_HVSC_SubKey
fr: %d fichiers téléchargeables.

source: Browser_LocalBrowsing_MainKey
fr: Fichiers locaux

source: Browser_LocalBrowsing_SubKey
fr: Parcourir, écouter, supprimer.

source: Browser_MODLAND_MainKey
fr: MODLAND collection

source: Browser_MODLAND_SubKey
fr: %d fichiers téléchargeables.

source: Browser_Most_played_MainKey
fr: Les plus joués

source: Browser_Most_played_SubKey
fr: Ecouter les fichiers les plus joués.

source: Browser_Playlists_MainKey
fr: Listes de lecture

source: Browser_Playlists_SubKey
fr: Organiser, créer, supprimer & écouter.

source: Browser_UserGuide_MainKey
fr: Guide d'utilisation

source: Browser_UserGuide_SubKey
fr: Manuel, FAQ, astuces.

source: Browser_Web_MainKey
fr: Web

source: Browser_Web_SubKey
fr: Naviguer et télécharger des fichiers.

source: Browser_WebVGM_MainKey
fr: VGMRips

source: Browser_WebVGM_SubKey
fr: Video game music rips

source: Browser_WorldCharts_SubKey
fr: Top listes & liens.

source: Cache cleaned
fr: Cache vidé

source: Cancel
fr: Annuler

source: Cancelling...
fr: Annulation...

source: Cannot download from this URL.
fr: Téléchargement impossible depuis cette URL.

source: Cannot use iCloud as folder name
fr: Ne peut pas utiliser iCloud comme nom de dossier

source: Choose a new name.
fr: Choisir un nouveau nom.

source: Choose a playlist
fr: Choisissez une liste

source: Choose a song
fr: Liste des morceaux

source: Choose a subsong
fr: Liste des subsongs

source: Choose_SaveCover
fr: Enregistrer comme jaquette pour %@ ?

source: Clean Database
fr: Nettoyage de la base

source: Clean DB, Reset ratings, ...
fr: Nettoyage DB, raz des notes, ...

source: Cleaning DB & reseting settings
fr: Nettoyage de la DB & réinitialisation des réglages

source: Clear 'Now Playing' queue
fr: Reset 'Lecture en cours'

source: Clear images cache
fr: Vider le cache d'images

source: Close
fr: Fermer

source: Confirm_CheckFiles
fr: Voulez vous effectuer la maintenance des fichiers locaux ?

source: Confirm_DBClean
fr: Lancer le nettoyage de la base (potentiellement long) ?

source: Confirm_FormatDownloads
fr: Voulez vous formater le dossier 'Downloads' ?

source: Confirm_RecreateSamples
fr: Voulez vous recréer le dossier 'Samples' ?

source: Confirm_RemCurCovers
fr: Effacer les couvertures de %@ (fichier et dossier) ?

source: Confirm_Reset_PlCnt
fr: Voulez vous reinitialiser les compteurs de lecture ?

source: Confirm_Reset_Ratings
fr: Voulez vous reinitialiser les notes ?

source: Confirm_ResetDB
fr: Voulez vous reinitialiser toute la base de donées ? Les listes, notes et compteurs de lecture seront effacés.

source: Confirm_SettingsDef
fr: Voulez vous réinitialiser les réglages avec les valeurs par défaut ?

source: Confirm_SettingsHigh
fr: Voulez vous réinitialiser les réglages avec les valeurs hautes ?

source: Confirm_SettingsLow
fr: Voulez vous réinitialiser les réglages avec les valeurs basses ?

source: Confirm_SettingsMed
fr: Voulez vous réinitialiser les réglages avec les valeurs moyennes ?

source: Contact support by email
fr: Contacter le support par email

source: Could not add files. Please check manually with file browser (Local Browsing/Downloads).
fr: Les fichiers n'ont pas pu être ajoutés. Veuillez vérifier manuellement dans le dossier 'Downloads'.

source: Cover removed
fr: Jaquette supprimée

source: CoverFile
fr: Jaquette/Fichier

source: CoverFolder
fr: Jaquette/Dossier

source: Create a new empty playlist.
fr: Créer une nouvelle liste vide.

source: Create a new playlist
fr: Créer une nouvelle liste

source: Create a playlist from currently played files.
fr: Sauve la liste en cours d'écoute.

source: Cut
fr: Couper

source: Database cleaned
fr: Base nettoyée

source: Database created.
fr: Base de données créée.

source: Database reseted
fr: Base reinitialisée

source: Database will now be recreated. Please validate & wait.
fr: La base de donnée va être recréée. Veuillez valider et patienter svp.

source: Default length
fr: Durée par défaut

source: Default length %d:%.2d
fr: Durée par défaut %d:%.2d

source: Delete
fr: Effacer

source: DisplayAll_MainKey
fr: Lister tout trié par nom

source: DisplayAll_SubKey
fr: Dossier courant:

source: DisplayAllPath_MainKey
fr: Lister tout trié par chemin

source: DisplayAllPath_SubKey
fr: Tout trié par nom:

source: DisplayDir_MainKey
fr: Lister/Dossier

source: DisplayDir_SubKey
fr: Tout trié par chemin:

source: Download queue: %d files
fr: File de téléchargement: %d fichiers

source: Download queue: 1 file
fr: File de téléchargement: 1 fichier

source: Downloaded %@
fr: %@ téléchargé

source: Downloading %@
fr: Télécharge %@

source: Downloads
fr: Téléchargements

source: Edit
fr: Editer

source: Enter folder name
fr: Entrez le nom du dossier

source: Enter new name
fr: Entrez le nouveau nom

source: Enter playlist name
fr: Entrez le nom de la liste

source: Error
fr: Erreur

source: Extract
fr: Extraire

source: Extracting
fr: Décompression

source: Favorites
fr: Favoris

source: Favorites (%d)
fr: Favoris (%d)

source: Favorites...
fr: Favoris...

source: File already available locally. Do you want to download it again?
fr: Fichier déjà disponible. Souhaitez vous poursuivre le téléchargement ?

source: File cannot be played. Skipping to next playable file.
fr: Ne pas jouer le fichier. Saut jusqu'au prochain fichier jouable.

source: File is not available locally. Trigerring download from iCloud, please check in 'Files' application.
fr: Fichier absent de l'appareil. Démarrage du téléchargement depuis iCloud, veuillez vérifier dans l'application 'Fichiers'.

source: Formats: %d entries.
fr: Formats: %d entrées.

source: Formats/Artists/Files
fr: Formats/Artistes/Fichiers

source: Games Music
fr: Musiques de jeux

source: General Settings
fr: Réglages généraux

source: Generate a randomized playlist
fr: Générer une liste aléatoire

source: GetAllEntries_MainKey
fr: Tout télécharger

source: GetAllEntries_SubKey
fr: Limité à 256 téléchargements.

source: HVSC (%d, limited to %d)
fr: HVSC (%d, limité à %d)

source: HVSC/Search off
fr: HVSC/Recherche off

source: Image detected
fr: Image détectée

source: Issue %d while creating folder %@
fr: Erreur %d lors de la tentative de création du dossier %@

source: Issue %d while moving: %@. %@
fr: Erreur %d lors de la tentative de déplacement: %@. %@

source: Issue %d while trying to delete entry. %@
fr: Erreur %d lors de la tentative de suppression. %@

source: Issue %d while trying to renamefile. %@
fr: Erreur %d lors de la tentative de renommage. %@

source: Loading
fr: Chargement

source: Loading & parsing
fr: Charge & analyse

source: Local (%d, limited to %d)
fr: Local (%d, limité à %d)

source: Local/Search off
fr: Local/Recherche off

source: Mail support
fr: Contacter le support

source: Modland (%d, limited to %d)
fr: Modland (%d, limité à %d)

source: Modland/Search off
fr: Modland/Recherche off

source: More actions...
fr: Plus d'actions...

source: Most played
fr: Les plus joués

source: Most played (%d)
fr: Les plus joués (%d)

source: Most played...
fr: Les plus joués...

source: Never played.
fr: Jamais joué.

source: New folder
fr: Nv.dossier

source: New playlist
fr: Nouvelle liste

source: Next
fr: Suivant

source: Next file
fr: Fichier suivant

source: No
fr: Non

source: No cover to remove
fr: Pas de jaquette à supprimer

source: No database found. Will create a new one. Please validate & wait...
fr: Pas de base de données. Veuillez svp valider et patienter pendant la création.

source: No download in progress
fr: Pas de téléchargement en cours

source: No entry
fr: Aucune entrée

source: No file to extract or not supported archive format.
fr: Pas de fichier à extraire ou format archive non supporté.

source: Nothing currently playing. Please select a file.
fr: Pas de lecture en cours. Veuillez choisir un ficher.

source: Nothing to paste
fr: Rien à coller

source: Now playing
fr: Lecture en cours

source: Now playing...
fr: Lecture en cours...

source: Now playing(%d)
fr: Lecture en cours(%d)

source: Other
fr: Autre

source: Paste
fr: Coller

source: Played %d times.
fr: Joué %d fois.

source: Played Counters reseted
fr: Compteurs de lecture reinitialisés

source: Played once.
fr: Joué 1 fois.

source: Playlist (%d)
fr: Listes (%d)

source: Playlist is full. Delete some entries to add more.
fr: La liste est pleine. Veuillez supprimer des entrées.

source: Playlist/Search off
fr: Listes/Recherche off

source: Please activate at least 1 section for your search.
fr: Activez au moins 1 section svp.

source: Please choose
fr: Choisissez svp

source: Please enter at least 2 characters for your search.
fr: Entrez au moins 2 caractères svp.

source: Previous
fr: Précédent

source: Previous file
fr: Fichier précédent

source: Random picks
fr: Choix aléatoires

source: Ratings reseted
fr: Notes reinitialisées

source: Recreate Samples folder
fr: Recréer le dossier Samples

source: Refreshing
fr: Mise à jour

source: Remove current cover
fr: Supprimer la jaquette

source: Remove from favorites
fr: Supprimer des favoris

source: Rename
fr: Renommer

source: Rename playlist
fr: Renommer la liste

source: Reset Database
fr: Reset complet de la base

source: Reset Played Counters
fr: Reset des compteurs de lecture

source: Reset Ratings
fr: Reset des notes

source: Reset settings to default
fr: Reinit. les réglages

source: Resume position on launch
fr: Reprise position de lecture au démarrage

source: Resuming last played file
fr: Reprise du dernier fichier en cours

source: Samples folder created
fr: Dossier Samples recréé

source: Save
fr: Sauver

source: Save current one
fr: Sauver liste en cours

source: Search: simplified regexp ('.'->'\.', '*'->'.*')
fr: Recherche: regexp simplifiées ('.'->'\.', '*'->'.*')

source: Searching HVSC...
fr: Recherche HVSC...

source: Searching Local files...
fr: Recherche en local...

source: Searching MODLAND...
fr: Recherche MODLAND...

source: Searching Playlists...
fr: Recherche listes...

source: Seeking
fr: Recherche

source: Seeking %d%%
fr: Recherche %d%%

source: Settings
fr: Réglages

source: Settings reseted
fr: Réglages reinitialisés

source: Settings_CleanDB
fr: Nettoyage de la base

source: Settings_DB
fr: Base de données

source: Settings_Display
fr: Affichage

source: Settings_Download
fr: Téléchargement

source: Settings_FormatDownloads
fr: Formater le dossier 'Downloads'

source: Settings_FTP
fr: FTP

source: Settings_General
fr: General

source: Settings_LocalFiles
fr: Fichiers locaux

source: Settings_PlaybackLib
fr: Bibliothèques de lecture

source: Settings_Player
fr: Lecteur

source: Settings_RecreateSamples
fr: Recréer le dossier 'Samples'

source: Settings_RemCovers
fr: Supprimer jaquettes

source: Settings_ResetDB
fr: Reset complet de la base

source: Settings_ResetPlCnt
fr: Reset des compteurs de lecture

source: Settings_ResetRatings
fr: Reset des notes

source: Settings_Settings
fr: Réglages

source: Settings_SettingsDefault
fr: Défaut

source: Settings_SettingsHigh
fr: Haut

source: Settings_SettingsLow
fr: Bas

source: Settings_SettingsMed
fr: Moyen

source: Settings_UpdateFilesBackupFlag
fr: Verifier fichiers

source: Shuffle
fr: Mélanger

source: Size: %dKB
fr: Taille: %dKB

source: Some general informations
fr: Informations générales

source: Sort A->Z
fr: Tri A->Z

source: Sort A->Z (fullpath)
fr: Tri A->Z (chemin complet)

source: Sort Z->A
fr: Tri Z->A

source: Sort Z->A (fullpath)
fr: Tri Z->A (chemin complet)

source: Thousands of entries
fr: Des milliers d'entrées

source: Too much entries! Playlist will be limited to %d first entries.
fr: Trop d'entrées! La liste est limitée à %d entrées.

source: unavailable
fr: indisponible

source: URL have to start with ftp:// or http://
fr: L'URL doit commencer par ftp:// ou http://

source: Voices control
fr: Contrôle des voix

source: Warning
fr: Attention

source: Web browser
fr: Navigateur web

source: Old database version: %d.%d. Will update to %d.%d. Please validate & wait.
fr: Ancienne version de la BdD: %d.%d. Veuillez valider et patienter pour mettre à jour en %d.%d svp.

source: Yes
fr: Oui

source: Default Players
fr: Lecteurs par défaut

source: MOD player
fr: Lecteur MOD

source: SAP player
fr: Lecteur SAP

source: SID player
fr: Lecteur SID

source: VGM player
fr: Lecteur VGM

source: NSF player
fr: Lecteur NSF

source: GBS player
fr: Lecteur GBS

source: KSS player
fr: Lecteur KSS

source: 2SF player
fr: Lecteur 2SF

source: MIDI player
fr: Lecteur MIDI

source: Adplug priority for module
fr: Priorité ADPlug/OMPT pour les mods FM

source: Visualizers
fr: Visualiseurs

source: Disable screen auto lock
fr: Désactiver le verouillage auto

source: Force Mono
fr: Forcer mono

source: Panning (Stereo separation)
fr: Panning (Séparation stéréo)

source: Panning value
fr: Niveau de panning

source: Default Length
fr: Durée par défaut

source: Audio latency in ms
fr: Latence audio en ms

source: 0=auto, delay rounded to a multiple of audio buffer size
fr: 0=auto, délai arrondi au multiple de la taille du buffer audio

source: Multi default action
fr: Multi action par défaut

source: Default action when selecting an archive or a multisong file
fr: Action par défaut quand une archive ou un fichier multi morceaux est sélectionné

source: Archive/multi play mode
fr: Archive/multi mode de lecture

source: Play only selected entry or full archive/multisong file
fr: Jouer uniquement l'entrée sélectionnée ou l'ensemble

source: Browse
fr: Naviguer

source: Entry
fr: Entrée

source: Full
fr: Tout

source: Default Action
fr: Action par défaut

source: Play
fr: Jouer

source: Enqueue
fr: File d'attente

source: Enq.&Play
fr: FdA&Jouer

source: First
fr: Premier

source: Current
fr: Actuelle

source: Last
fr: Dernier

source: Enqueue position
fr: Position d'ajout file d'attente

source: Post download action
fr: Action post download

source: Nothing
fr: Rien

source: Background mode
fr: Mode arrière plan

source: Partial
fr: Partiel

source: Off=no background process, Partial=keep playing music, Full=keep app on in background
fr: Off=pas de processus en arrière plan, Partiel=continue à jouer la musique, Tout=garde l'app active en arrière plan

source: Long name truncate
fr: Troncage des noms longs

source: Head
fr: Début

source: Mid.
fr: Mil.

source: Tail
fr: Fin

source: Filename as title
fr: Nom de fichier comme titre

source: Auto. restore Samples folder
fr: Restauration auto du dossier 'Samples'

source: Send statistics
fr: Partager statistiques

source: Stereo separation
fr: Séparation stéréo

source: Master volume
fr: Volume principal

source: Amiga 500 Filter
fr: Filtre Amiga 500

source: Resampling
fr: Rééchantillonnage

source: Force loop
fr: Forcer bouclage

source: Max loop
fr: Nbre de boucles

source: Fade out time
fr: Durée de fondu

source: Clock
fr: Horloge

source: Model
fr: Modèle

source: Force 2nd SID
fr: Forcer 2e SID

source: Address 2nd
fr: Adresse 2e

source: 0xD420-0xD7FF or 0xDE00-0xDFFF
fr: 0xD420-0xD7FF ou 0xDE00-0xDFFF

source: Force 3rd SID
fr: Forcer 3e SID

source: Address 3rd
fr: Adresse 3e

source: Japanese Tag
fr: Tag japonais

source: Enable playback ratio
fr: Activer ratio de lecture

source: Playback ratio
fr: Ratio de lecture

source: Headphones
fr: Casque

source: Normalization
fr: Normalisation

source: Gain value
fr: Valeur de gain

source: Force NTSC
fr: Forcer NTSC

source: Panning
fr: Séparation stéréo

source: MIDI polyphony
fr: Polyphonie MIDI

source: LP filter
fr: Filtre passe-bas

source: HP filter
fr: Filtre passe-haut

source: Engine
fr: Moteur

source: Filter
fr: Filtre

source: Silence detection
fr: Détection des silences

source: Equalizer
fr: Equaliseur

source: Bass
fr: Graves

source: Treble
fr: Aigus

source: Highpass filter type
fr: Type de filtre passe-haut

source: Will skip song if nothing is played for specified duration (0=off)
fr: Termine le morceau si rien n'est joué dans la durée choisie (0=off)

source: Harmonic
fr: Harmonique

source: Oscillo settings
fr: Réglages oscillo

source: FX Level of details
fr: FX niveau de détails

source: Activate Piano roll FX, standard or 'Synthesia' like
fr: Active l'effet piano roll en mode 'Standard' ou 'Synthesia'

source: Activate spark FX, colored or white
fr: Active l'effet étincelle, colorée ou blanche

source: Display voices labels
fr: Affiche les noms des voix

source: Display octaves labels
fr: Affiche les numéros d'octaves

source: Region
fr: Région

source: Force IRQ
fr: Forcer IRQ

source: Quality
fr: Qualité

source: VRC7 Patches
fr: Patches VRC7

source: Min=off, default: 112
fr: Min=off, défaut: 112

source: Max=off, default: 164
fr: Max=off, défaut: 164

source: 1/2/3=NTSC/PAL/DENDY 4/5/6=force NTSC/PAL/DENDY
fr: 1/2/3=NTSC/PAL/DENDY 4/5/6=forcer NTSC/PAL/DENDY

source: Forces IRQ capability for all NSFs, not just NSF2
fr: Force le support IRQ pour tous les NSFs (pas uniquement les NSF2.

source: Oversampling. Min=0, default: 10
fr: Suréchantillonnage. Min=0, défaut: 10

source: prevents high frequency aliasing
fr: empêche l'aliasing hautes fréquences

source: Custom color 01
fr: Couleur personalisée 01

source: Custom color 02
fr: Couleur personalisée 02

source: Custom color 03
fr: Couleur personalisée 03

source: Custom color 04
fr: Couleur personalisée 04

source: Custom color 05
fr: Couleur personalisée 05

source: Custom color 06
fr: Couleur personalisée 06

source: Custom color 07
fr: Couleur personalisée 07

source: Custom color 08
fr: Couleur personalisée 08

source: Custom color 09
fr: Couleur personalisée 09

source: Custom color 10
fr: Couleur personalisée 10

source: Custom color 11
fr: Couleur personalisée 11

source: Custom color 12
fr: Couleur personalisée 12

source: Custom color 13
fr: Couleur personalisée 13

source: Custom color 14
fr: Couleur personalisée 14

source: Custom color 15
fr: Couleur personalisée 15

source: Custom color 16
fr: Couleur personalisée 16

source: Custom color 17
fr: Couleur personalisée 17

source: Custom color 18
fr: Couleur personalisée 18

source: Custom color 19
fr: Couleur personalisée 19

source: Custom color 20
fr: Couleur personalisée 20

source: Custom color 21
fr: Couleur personalisée 21

source: Custom color 22
fr: Couleur personalisée 22

source: Custom color 23
fr: Couleur personalisée 23

source: Custom color 24
fr: Couleur personalisée 24

source: Custom color 25
fr: Couleur personalisée 25

source: Custom color 26
fr: Couleur personalisée 26

source: Custom color 27
fr: Couleur personalisée 27

source: Custom color 28
fr: Couleur personalisée 28

source: Custom color 29
fr: Couleur personalisée 29

source: Custom color 30
fr: Couleur personalisée 30

source: Custom color 31
fr: Couleur personalisée 31

source: Custom color 32
fr: Couleur personalisée 32

source: Custom
fr: Personalisé

source: Only for plugins supporting this feature (GME, NSFPLAY, LIBVGM)
fr: Seulement pour les plugins supportant cette fonctionnalité (GME, NSFPLAY, LIBVGM)

source: Clean
fr: Nettoyer

source: Are you sure you want to clean the DB, it might take a while ?
fr: Etes vous sûr de vouloir nettoyer la base de données, ca peut prendre un moment ?

source: Cleaning DB
fr: Nettoyage de la BdD

source: Please wait, it can take a while
fr: Veuillez patienter, cela peut prendre un moment
