Repository: yoyofr/modizer
Catalog: modizer/*.lproj/Localizable.strings
Languages: fr

# Browser_LocalBrowsing_MainKey
source: Local browsing
fr: Fichiers locaux

# Browser_LocalBrowsing_SubKey
source: Browse, play & delete local files.
fr: Parcourir, écouter, supprimer.

# Browser_MODLAND_SubKey
source: %d downloadable files.
fr: %d fichiers téléchargeables.

# Browser_HVSC_SubKey
source: %d downloadable files.
fr: %d fichiers téléchargeables.

# Browser_Playlists_MainKey
source: Playlists
fr: Listes de lecture

# Browser_Playlists_SubKey
source: Organize, create, delete & listen.
fr: Organiser, créer, supprimer & écouter.

# Browser_Favorites_MainKey
source: Favorites
fr: Favoris

# Browser_Favorites_SubKey
source: Listen to rated songs.
fr: Ecouter les fichiers les mieux notés.

# Browser_Most_played_MainKey
source: Most played
fr: Les plus joués

# Browser_Most_played_SubKey
source: Listen to most played songs.
fr: Ecouter les fichiers les plus joués.

# Browser_Web_SubKey
source: Browse Internet & download music.
fr: Naviguer et télécharger des fichiers.

# Browser_WorldCharts_MainKey
source: World Charts
fr: Classements mondial

# Browser_WorldCharts_SubKey
source: Top lists & download links.
fr: Top listes & liens.

# Browser_UserGuide_MainKey
source: User Guide
fr: Guide d'utilisation

# Browser_UserGuide_SubKey
source: Manual, FAQ, tips.
fr: Manuel, FAQ, astuces.

# GetAllEntries_MainKey
source: Get all missing entries
fr: Tout télécharger

# GetAllEntries_SubKey
source: Limited to 256 first missing entries.
fr: Limité à 256 téléchargements.

# DisplayDir_MainKey
source: List/Directory
fr: Lister/Dossier

# DisplayDir_SubKey
source: All:
fr: Tout:

# DisplayAll_MainKey
source: List All
fr: Lister tout

# DisplayAll_SubKey
source: Current dir:
fr: Dossier courant:

source: Formats/Artists/Files
fr: Formats/Artistes/Fichiers

source: Artists/Formats/Files
fr: Artistes/Formats/Fichiers

source: Artists/Files
fr: Artistes/Fichiers

source: Formats: %d entries.
fr: Formats: %d entrées.

source: Artists: %d entries.
fr: Artistes: %d entrées.

source: Played %d times.
fr: Joué %d fois.

source: Played once.
fr: Joué 1 fois.

source: Never played.
fr: Jamais joué.

source: %d files.
fr: %d fichiers.

source: 1 file.
fr: 1 fichier.

source: New playlist
fr: Nouvelle liste

source: Save current one
fr: Sauver liste en cours

source: Create a new empty playlist.
fr: Créer une nouvelle liste vide.

source: Create a playlist from currently played files.
fr: Sauve la liste en cours d'écoute.

source: Browse files
fr: Parcourir les fichiers

source: Add or remove entries from browser.
fr: Ajouter/supprimer des fichiers.

source: Rename playlist
fr: Renommer la liste

source: Choose a new name.
fr: Choisir un nouveau nom.

source: Playlist (%d)
fr: Listes (%d)

source: Playlist/Search off
fr: Listes/Recherche off

source: Local (%d, limited to %d)
fr: Local (%d, limité à %d)

source: Local/Search off
fr: Local/Recherche off

source: Modland (%d, limited to %d)
fr: Modland (%d, limité à %d)

source: Modland/Search off
fr: Modland/Recherche off

source: HVSC (%d, limited to %d)
fr: HVSC (%d, limité à %d)

source: HVSC/Search off
fr: HVSC/Recherche off

source: Searching Playlists...
fr: Recherche listes...

source: Searching Local files...
fr: Recherche en local...

source: Searching MODLAND...
fr: Recherche MODLAND...

source: Searching HVSC...
fr: Recherche HVSC...

source: Please enter at least 2 characters for your search.
fr: Entrez au moins 2 caractères svp.

source: Please activate at least 1 section for your search.
fr: Activez au moins 1 section svp.

source: Database created.
fr: Base de données créée.

source: Database will now be recreated. Please validate & wait.
fr: La base de donnée va être recréée. Veuillez valider et patienter svp.

source: Wrong database version: %d.%d. Will update to %d.%d. Please validate & wait.
fr: Mauvaise version : %d.%d. Veuillez valider et patienter pour mettre à jour en %d.%d svp.

source: No database found. Will create a new one. Please validate & wait...
fr: Pas de base de données. Veuillez svp valider et patienter pendant la création.

source: File already available locally. Do you want to download it again?
fr: Fichier déjà disponible. Souhaitez vous poursuivre le téléchargement ?

source: Playlist is full. Delete some entries to add more.
fr: La liste est pleine. Veuillez supprimer des entrées.

source: No download in progress
fr: Pas de téléchargement en cours

source: Downloaded %@
fr: %@ téléchargé

source: Could not add files. Please check manually with file browser (Local Browsing/Downloads).
fr: Les fichiers n'ont pas pu être ajoutés. Veuillez vérifier manuellement dans le dossier 'Downloads'.

source: Downloading %@
fr: Télécharge %@

source: Cannot download from this URL.
fr: Téléchargement impossible depuis cette URL.

source: Yes
fr: Oui

source: No
fr: Non

source: Error
fr: Erreur

source: Warning
fr: Attention

source: Close
fr: Fermer

source: File cannot be played. Skipping to next playable file.
fr: Ne pas jouer le fichier. Saut jusqu'au prochain fichier jouable.

source: Seeking %d%%
fr: Recherche %d%%

source: Seeking
fr: Recherche

source: Too much entries! Playlist will be limited to %d first entries.
fr: Trop d'entrées! La liste est limitée à %d entrées.

source: Size: %dKB
fr: Taille: %dKB

source: URL have to start with ftp:// or http://
fr: L'URL doit commencer par ftp:// ou http://

# Settings_Player
source: Player
fr: Lecteur

# Settings_Display
source: Display
fr: Affichage

# Settings_Download
source: Download
fr: Téléchargement

# Settings_PlaybackLib
source: Playback libraries
fr: Bibliothèques de lecture

# Settings_DB
source: Database
fr: Base de données

# Settings_CleanDB
source: Clean Database
fr: Nettoyage de la base

# Settings_ResetPlCnt
source: Reset play counters
fr: Reset des compteurs de lecture

# Settings_ResetRatings
source: Reset Ratings
fr: Reset des notes

# Settings_ResetDB
source: Reset whole database
fr: Reset complet de la base

# Settings_LocalFiles
source: Local Files
fr: Fichiers locaux

# Settings_RecreateSamples
source: Recreate 'Samples' folder
fr: Recréer le dossier 'Samples'

# Settings_FormatDownloads
source: Format 'Downloads' folder
fr: Formater le dossier 'Downloads'

# Settings_RemCovers
source: Remove covers
fr: Supprimer jaquettes

# Settings_UpdateFilesBackupFlag
source: Check Filesystem
fr: Verifier fichiers

# Confirm_DBClean
source: Launch database cleaning (can take a while)?
fr: Lancer le nettoyage de la base (potentiellement long) ?

# Confirm_Reset_PlCnt
source: Are you sure you want to reset all the play counter?
fr: Voulez vous reinitialiser les compteurs de lecture ?

# Confirm_Reset_Ratings
source: Are you sure you want to reset all the ratings?
fr: Voulez vous reinitialiser les notes ?

# Confirm_ResetDB
source: Are you sure you want to reset the whole database? Playlists, ratings, counters will be deleted.
fr: Voulez vous reinitialiser toute la base de donées ? Les playlists, notes et compteurs de lecture seront effacés.

# Confirm_RecreateSamples
source: Do you want to recreate 'Samples' folder.
fr: Voulez vous recréer le dossier 'Samples' ?

# Confirm_FormatDownloads
source: Do you want to remove ALL files from Local Browsing/Web folder.
fr: Voulez vous formater le dossier 'Downloads' ?

# Confirm_CheckFiles
source: Do you want to perform local filesystem check ?
fr: Voulez vous effectuer la maintenance des fichiers locaux ?

source: Image detected
fr: Image détectée

# Choose_SaveCover
source: Save image as cover for %@?
fr: Enregistrer comme jaquette pour %@ ?

# CoverFolder
source: As Folder cover
fr: Jaquette/Dossier

# CoverFile
source: As File cover
fr: Jaquette/Fichier

# Confirm_RemCurCovers
source: Remove current covers for %@ (folder&file)?
fr: Effacer les couvertures de %@ (fichier et dossier) ?

# Settings_Settings
source: Settings
fr: Réglages

# Settings_SettingsDefault
source: Default
fr: Défaut

# Settings_SettingsHigh
source: High
fr: Haut

# Settings_SettingsMed
source: Medium
fr: Moyen

# Settings_SettingsLow
source: Low
fr: Bas

# Confirm_SettingsDef
source: Are you sure you want to reset settings with 'default' values?
fr: Voulez vous réinitialiser les réglages avec les valeurs par défaut ?

# Confirm_SettingsHigh
source: Are you sure you want to reset settings with 'high' values?
fr: Voulez vous réinitialiser les réglages avec les valeurs hautes ?

# Confirm_SettingsMed
source: Are you sure you want to reset settings with 'medium' values?
fr: Voulez vous réinitialiser les réglages avec les valeurs moyennes ?

# Confirm_SettingsLow
source: Are you sure you want to reset settings with 'low' values?
fr: Voulez vous réinitialiser les réglages avec les valeurs basses ?

# Browser not enough mem.
source: Too much entries, cannot allocate memory.
fr: Trop d'entrées, ne peut allouer assez de mémoire.

# Browser not enough mem. Limited.
source: Too much entries, cannot allocate memory. List is incomplete.
fr: Trop d'entrées, ne peut allouer assez de mémoire. Liste tronquée.

source: Default length %d:%.2d
fr: Durée par défaut %d:%.2d

source: Issue %d while trying to delete entry. %@
fr: Erreur %d lors de la tentative de suppression. %@

source: Issue %d while trying to renamefile. %@
fr: Erreur %d lors de la tentative de renommage. %@

source: Issue %d while moving: %@. %@
fr: Erreur %d lors de la tentative de déplacement: %@. %@

source: Issue %d while creating folder %@
fr: Erreur %d lors de la tentative de création du dossier %@

source: Rename
fr: Renommer

source: Delete
fr: Supprimer

source: Choose a subsong
fr: Liste des subsongs

source: Choose a song
fr: Liste des morceaux

source: Cut
fr: Couper

source: Paste
fr: Coller

source: New folder
fr: Nv.dossier

source: Nothing to paste
fr: Rien à coller

source: Enter folder name
fr: Entrez le nom du dossier
